<script>
    // import MillView from './components/MillView.vue'
    import CurrentModelView from './components/CurrentModelView.vue';
    import ModelPreview from './components/ModelPreview.vue';

    export default {
        name: 'App',
        components: {
            CurrentModelView,
            ModelPreview,
            // MillView
        },
        data() {
            return {
                mobile: this.mobile,
                current_id: 0,
                preview_start_index: 0,
                models: [ 
                { name: "Водяная мельница", difficulty: 2, picture: require("./assets/previews/WhaterMill.png"), glb: '/3d/WaterMill.glb',
                    description: `Водяная мельница из картона может быть очень креативным и увлекательным проектом! Вот как можно описать эту модель:
                <br>Колесо водяной мельницы: Изготовлено из картона с лопастями, которые можно вращать, чтобы создать иллюзию движущегося механизма.
                <br>Здание мельницы: Может быть выполнено из картона с окнами, дверьми и крышей. Украсьте его деталями, чтобы сделать его более реалистичным.
                <br>Детали интерьера: Добавьте внутри мельницы мельничный камень, мешки со зерном, инструменты и другие детали для украшения.
                <br>Ручей или поток воды: Можно создать небольшой канал из картона, чтобы водяное колесо могло "работать" под напором воды.`},
                { name: "Кузница", difficulty: 5, picture: require("./assets/previews/Smithy.png"), glb: '/3d/Blacksmith.glb',
                    description: `Погрузитесь в мир ремесла и мастерства с нашей уникальной сборной моделью из картона 'Кузница'!
                    <br>Эта модель позволит вам почувствовать себя настоящим мастером в своей мастерской. Соберите каждую деталь с любовью и вниманием к деталям, чтобы создать удивительную кузню в миниатюре.
                    <br>Каждая часть модели тщательно проработана для создания реалистичного и увлекательного опыта сборки. Собирайте ее в удобное для вас время, наслаждаясь процессом творчества и получая удовольствие от каждого шага.
                    <br>Идеальный подарок для ценителей истории, ремесел и рукоделия. Закажите вашу сборную модель 'Кузница' прямо сейчас и создайте свой шедевр собственными руками!`},
                { name: "Шагающий дом",  difficulty: 5, picture: require("./assets/previews/WalkingHouse.png"), glb: '/3d/WalkingHouse.glb',
                    description: `"Шагающий дом" - это удивительная сборная модель из картона, которая представляет собой уникальное сочетание фантазии и механики. 🏠✨
                    <br>🏠 Структура дома: Изготовлена из прочного картона, позволяющего модели держать форму и выдерживать небольшую нагрузку.
                    <br>🚶‍♂️🚶‍♀️ Передвижение: "Шагающий дом" оснащен механизмом, который позволяет ему двигаться, имитируя шаги. Этот удивительный эффект создает ощущение, что дом оживает и совершает плавные передвижения.
                    <br>"Шагающий дом" - это не просто модель, это целый мир фантазии и творчества, который заставит удивляться и восхищаться всех, кто увидит его в движении! 🌟🏠`},
                { name: "Портовый кран", difficulty: 3,  picture: require("./assets/previews/PortCrane.png"), glb: '/3d/Castle.glb',
                    description: `Портовый кран" - это сборная модель из картона, изображающая средневековый подъемный кран, который функционирует как настоящий! 🏗️🏰
                    <br>🏭 Функциональность: Эта миниатюрная модель не просто статична, она имеет рабочие механизмы подъема и опускания груза, что позволяет вам на собственном опыте пережить процесс работы средневекового портового крана.
                    <br>🕰️ Историческая точность: Для создания модели использовались исторические изображения, чтобы в точности передать аутентичный вид и функциональность подъемного крана того времени.
                    <br>"Портовый кран" из картона - это не только увлекательная сборочная модель, но и возможность погрузиться в атмосферу средневековья и узнать больше о том, какими были технологии того времени! 🕰️🛳️`},
                { name: "Галера", difficulty: 4, picture: require("./assets/previews/Galley.png"), glb: '/3d/Castle.glb',
                    description: `"Галера" - это восхитительная сборная модель из картона, переносящая вас в величественную эпоху морских приключений и торговли. 🚢🌊
                    <br>🏰 Дизайн: Модель представляет собой детально проработанную галеру, типичный корабль эпохи Венецианской Республики - стройный и элегантный, с множеством парусов и украшений.
                    <br>🎨 Детали: Модель содержит множество мелких деталей, какими могут быть канаты, анкеры, корма, и другие элементы, что делает ее максимально реалистичной и привлекательной для изучения.
                    <br>"Галера Венецианской Республики" - это не просто модель, это путешествие в прошлое, запечатленное внутри картонных стен корабля, принесет вам удовольствие от сборки и восхищение от готового произведения искусства! ⚓️🌟`},
                ]
            }
        },
        methods: {
            goBack() {
                if (this.preview_start_index > 0) 
                    this.preview_start_index--;
            },
            goForward() {
                let max_index = this.models.length
                if (this.mobile) {
                    max_index -= 1
                }
                else max_index -= 3
                if (this.preview_start_index < max_index) 
                    this.preview_start_index++;
            },
            changeCurrent(new_index) {
                // console.log(`New current: ${new_index}`)
                if (new_index != undefined)
                    this.current_id = new_index;
            }
        },
        beforeCreate() {
            if(/Android|webOS|iPhone|iPad|iPod|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent))
                this.mobile = true;
            else this.mobile = false;
            console.log(`Is mobile: ${this.mobile}`);
        },
        mounted() {
            console.log(`Mounted mobile: ${this.mobile}`)
        } 
    }
</script>


<template>
    <div id="current" v-bind:class="{mobile: mobile}">
        <CurrentModelView :current_model="models[current_id]" :mobile="mobile"></CurrentModelView>
    </div>

    <div v-if="mobile" id="single-preview">
        <div class="button" @click="goBack">
            <img src="./assets/left_arrow_v2.png" alt="">
        </div>
        <ModelPreview
            :mobile="mobile"
            :id="preview_start_index"
            :model="models[preview_start_index]"
            @preview-clicked="changeCurrent">
        </ModelPreview>
        <div class="button" @click="goForward">
            <img src="./assets/right_arrow_v2.png" alt="">
        </div>
    </div>

    <div v-else id="previews-list">
        <div class="button" @click="goBack">
            <img src="./assets/left_arrow_v2.png" alt="">
        </div>
        <ModelPreview 
            v-for="shift in 3"
            :key="shift"
            :id="preview_start_index+shift-1"
            :model="models[preview_start_index+shift-1]"
            @preview-clicked="changeCurrent">
        </ModelPreview>
        <div class="button" @click="goForward">
            <img src="./assets/right_arrow_v2.png" alt="">
        </div>

    </div>


    <!-- <img alt="Vue logo" src="./assets/logo.png"> -->
     <!-- <HelloWorld msg="Welcome to Your Vue.js App"/> -->
</template>

<style scoped>
    #single-preview {
        display: flex;
        width: 100%;
        height: 15vh;
        justify-content: space-between;
        margin-top: 2vh
    }

    #single-preview h1 {
        font-size: 1rem;
    }
    #single-preview .button {
        width: 15%;
    }
</style>



<style scoped>
/* #app {
  font-family: Avenir, Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  color: #2c3e50;
  margin-top: 60px;
} */
    #current {
        width: 100%;
        height: 60vh;
        /* background-color: gray; */
    }
    .mobile#current {
        height: 75vh;
    }
    #previews-list {
        margin-top: 5%;
        /* background-color: gray; */
        height: 22%;
        display: flex;
        justify-content: space-between;
    }
    .button {
        background-color: rgb(233, 233, 233);
        height: 100%;
        width: 5%;
    }
    .button:hover {
        background-color: silver;
    }
    .button:active {
        background-color: rgb(177, 177, 177);
    }

    .button img {
        width: 100%;
        height: 40%;
        margin-top: 100%;
    }
</style>
